---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCProductWrapper
source: html/74b7f477-bcea-2419-f5e3-dda387f238f5.htm
---
# IFCProductWrapper Methods

Adds an annotation handle to associate with the IfcProduct in this wrapper.